# Чтение и запись данных, часть 2

## Домашнее задание 

### Описание домашнего задания и формат сдачи

Выполните предложенные задачи — впишите свой код в ячейки после комментария `### YOUR CODE HERE ###` и сохраните изменения, используя опцию *Save and Checkpoint* из вкладки меню *File* или кнопку *Save and Checkpoint* на панели инструментов. Итоговый файл в формате `.ipynb` (файл Jupyter Notebook) загрузите в личный кабинет и отправьте на проверку.

In [1]:
import pandas as pd
import urllib.request as req
import json
import sqlalchemy
import psycopg2
import pymongo

### Задача 1

Используя сервис MetaWeather узнайте, какая погода была в Лондоне 1 марта 2019 года. Для этого в первой ячейке определите идентификатор Лондона в этом сервисе, а во второй — запросите данные погоды. Обратите внимание, что сервис вернёт данные за несколько дней, а не только за 1 марта, в этой задаче это допустимо.

In [2]:
### YOUR CODE HERE ###
city = 'London'
url = f"https://www.metaweather.com/api/location/search/?query={city}"
print(url)

with req.urlopen(url) as responce:
   data = responce.read().decode() 

city_id = json.loads(data)[0]['woeid']

https://www.metaweather.com/api/location/search/?query=London

In [3]:
### YOUR CODE HERE ###
year, month, day  = '2020', '03', '01'

url = f'https://www.metaweather.com/api/location/{city_id}/{year}/{month}/{day}/'
print(url)

with req.urlopen(url) as responce:
    data = responce.read().decode()
    
data = json.loads(data)
data[:2]

https://www.metaweather.com/api/location/44418/2020/03/01/

[{'id': 6206170245103616,
  'weather_state_name': 'Light Cloud',
  'weather_state_abbr': 'lc',
  'wind_direction_compass': 'SW',
  'created': '2020-03-01T21:16:01.577747Z',
  'applicable_date': '2020-03-01',
  'min_temp': 4.565,
  'max_temp': 7.385,
  'the_temp': 7.19,
  'wind_speed': 10.990444571566053,
  'wind_direction': 236.15978082168533,
  'air_pressure': 989.0,
  'humidity': 59,
  'visibility': 10.77209098862642,
  'predictability': 70},
 {'id': 4732424023965696,
  'weather_state_name': 'Light Rain',
  'weather_state_abbr': 'lr',
  'wind_direction_compass': 'WSW',
  'created': '2020-03-01T18:16:03.274235Z',
  'applicable_date': '2020-03-01',
  'min_temp': 5.33,
  'max_temp': 9.815,
  'the_temp': 9.865,
  'wind_speed': 11.590553667777513,
  'wind_direction': 243.50534800847242,
  'air_pressure': 989.5,
  'humidity': 51,
  'visibility': 10.780479499721626,
  'predictability': 75}]

### Задача 2

Сохраните данные погоды, полученные в предыдущей задаче, в файл `weather.json`. При сохранении используйте четыре пробела для форматирования.

In [4]:
### YOUR CODE HERE ###
with open('weather.json', 'w') as fp:
    json.dump(data, fp, indent=4)

### Задача 3

Загрузите содержимое файла `weather.json` в DataFrame и выведите первые пять строк DataFrame на экран.

In [5]:
### YOUR CODE HERE ###
df = pd.read_json('weather.json')
df.head()

,id,weather_state_name,weather_state_abbr,wind_direction_compass,created,applicable_date,min_temp,max_temp,the_temp,wind_speed,wind_direction,air_pressure,humidity,visibility,predictability
0,6206170245103616,Light Cloud,lc,SW,2020-03-01T21:16:01.577747Z,2020-03-01,4.565,7.385,7.190,10.990445,236.159781,989.0,59,10.772091,70
1,4732424023965696,Light Rain,lr,WSW,2020-03-01T18:16:03.274235Z,2020-03-01,5.330,9.815,9.865,11.590554,243.505348,989.5,51,10.780479,75
2,5089920634847232,Light Rain,lr,WSW,2020-03-01T15:16:01.761744Z,2020-03-01,5.330,9.815,9.325,11.590554,243.505348,989.5,51,10.780479,75
3,5996345724764160,Light Rain,lr,SW,2020-03-01T12:16:02.159342Z,2020-03-01,5.505,9.575,9.040,10.184602,235.336740,990.5,53,11.166351,75
4,6619113969418240,Light Rain,lr,WSW,2020-03-01T09:16:01.914639Z,2020-03-01,5.485,9.010,8.990,10.572162,243.169160,990.5,51,12.575000,75

### Задача 4

Сохраните DataFrame из предыдущей задачи в файл `result.csv`. В качестве названия столбца-индекса используйте `index`.

In [6]:
### YOUR CODE HERE ###
df.to_csv('result.csv', index='index')

### Задача 5

Загрузите содержимое SQL-таблицы `ratings` в DataFrame. Выведите первые пять строк DataFrame на экран. Для подключения к БД используйте строку подключения, указанную в следующей ячейке.

In [7]:
conn_url = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

### YOUR CODE HERE ###
engine = sqlalchemy.create_engine(conn_url)
connect = engine.connect()

metadata = sqlalchemy.MetaData()
ratings_tbl = sqlalchemy.Table('ratings', metadata, autoload=True, autoload_with=engine)
stmt = sqlalchemy.select([ratings_tbl])

print(stmt)

df_ratings = pd.read_sql(stmt, connect)
df_ratings.head()

SELECT ratings.userid, ratings.movieid, ratings.rating, ratings.timestamp
FROM ratings

   userid  movieid  rating   timestamp
0    2733     1240     4.5  1128734106
1    2733     1246     3.5  1108092280
2    2733     1259     4.5  1108261821
3    2733     1265     4.0  1108431838
4    2733     1266     4.0  1108432122

### Задача 6

Сохраните первые 10000 записей датафрейма из предыдущей задачи в файл `result2.xlsx`, при сохранении задайте листу имя `MySheet`.

(Примечание: для указания имени листа в файле Excel как при чтении, так и при записи используется параметр `sheet_name`)

In [8]:
### YOUR CODE HERE ###
df_ratings.iloc[:10000,:]\
    .to_excel('result2.xlsx', sheet_name='MySheet')

### Задача 7

Определите количество документов в коллекции `users` в MongoDB. Если количество документов < 1000, то в следующей ячейке загрузите всё содержимое этой коллекции в список и выведите нулевой элемент этого списка на экран. Для подключения к MongoDB используйте строку подключения, указанную в следующей ячейке.

In [9]:
mdb_conn_url = 'mongodb://students:X63673t47Gl03Sq@dsstudents.skillbox.ru:27017/?authSource=movies'

### YOUR CODE HERE ###
client = pymongo.MongoClient(mdb_conn_url)
mdb = client['movies']
users_doc_count = mdb.users.estimated_document_count()
users_doc_count

100

In [10]:
### YOUR CODE HERE ###
if users_doc_count < 1000:
    res_list = list(mdb.users.find())
    print(res_list[0])

{'_id': ObjectId('5cc69095067496679c74f7a4'), 'user_id': 'ed5da480-57a2-489c-8e68-512155ab9892', 'first_name': 'Жанна', 'last_name': 'Петрова', 'mail': 'zhanna_03816@gmail.com', 'age': 20.0}

### Задача 8

Преобразуйте список всех документов коллекции `users` из предыдущей задачи в pandas DataFrame и сохраните его содержимое в файл `result3.xlsx`.

In [11]:
### YOUR CODE HERE ###
pd.DataFrame(res_list).to_excel('result3.xlsx')

## Дополнительные (необязательные) задачи

### Задача 9

Используя данные SQL-таблицы `ratings`, для каждого пользователя (столбец `userid`) определите средний рейтинг, который этот пользователь поставил фильмам. Результат выведите на экран. 

Группировку проведите двумя способами: с помощью `GROUP BY` в строке запроса к БД и с использованием метода `groupby` в pandas.

Для подключения к БД используйте строку подключения в следующей ячейке

In [12]:
conn_url = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

### YOUR CODE HERE ###
engine = sqlalchemy.create_engine(conn_url)
connect = engine.connect()

In [13]:

with engine.connect() as conn:
    cursor = conn.execute("select userid, avg(rating) as avg_rating from ratings group by userid order by 2 desc, 1")
    
pd.DataFrame(cursor, columns=cursor.keys())

      userid  avg_rating
0         57         5.0
1        121         5.0
2        214         5.0
3        238         5.0
4        258         5.0
...      ...         ...
7951    3860         0.5
7952    5013         0.5
7953    5313         0.5
7954    6206         0.5
7955    6296         0.5

[7956 rows x 2 columns]

In [14]:
### YOUR CODE HERE ###
df_9 = pd.read_sql('select * from ratings', connect)

In [15]:
df_9.groupby(by=['userid'])\
    .agg(avg_rating=('rating', 'mean'))\
    .reset_index()\
    .sort_values(by=['avg_rating', 'userid'], ascending=[False, True])

      userid  avg_rating
56        57         5.0
120      121         5.0
213      214         5.0
237      238         5.0
257      258         5.0
...      ...         ...
3859    3860         0.5
5012    5013         0.5
5312    5313         0.5
6205    6206         0.5
6295    6296         0.5

[7956 rows x 2 columns]

### Задача 10

Объедините таблицы `ratings` и `keywords` по столбцам `movieid` (используйте левое объединение). Объединение проведите двумя способами: с помощью `LEFT JOIN` в строке запроса к БД и с использованием метода `merge` в pandas. Результат объединения загрузите в DataFrame и сохраните в файл `result4.csv`.

Обратите внимание, что при объединении возможно дублирование столбцов. В результирующем датафрейме не должно быть таких дублированных столбцов.

In [16]:
conn_url = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

### YOUR CODE HERE ###
engine = sqlalchemy.create_engine(conn_url)

In [17]:
# Varian with SQL LEFT JOIN
# 

with engine.connect() as conn:
    data = conn.execute(
        '''
            SELECT DISTINCT ratings.userid, ratings.movieid,
                   ratings.rating, ratings."timestamp",
                   keywords.tags
              FROM ratings
              LEFT JOIN keywords
                ON ratings.movieid=keywords.movieid
        '''
    )
    
df_10 = pd.DataFrame(data, columns=data.keys())
df_10.to_csv('result4_1.csv', index=False)

In [18]:
print(df_10.head())
print(len(df_10.index[:]), ' rows affected')

   userid  movieid  rating   timestamp  \
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556

                                                tags
0  [{'id': 934, 'name': 'judge'}, {'id': 1533, 'n...
1  [{'id': 6930, 'name': 'fondling'}, {'id': 1018...
2  [{'id': 494, 'name': 'father son relationship'...
3                                               None
4  [{'id': 276, 'name': 'philadelphia'}, {'id': 3...
777776  rows affected

In [19]:
# Varian with pd.merge 
# 

df_ratings = pd.read_sql('select distinct * from ratings', engine.connect())
print('Table "ratings" head')
print(df_ratings.head())
print('\n\n')
print('Table "keywords" head')
df_keywords = pd.read_sql('select distinct * from keywords', engine.connect())
print(df_keywords.head())

Table "ratings" head
   userid  movieid  rating   timestamp
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556



Table "keywords" head
   movieid                                               tags
0        2  [{'id': 240, 'name': 'underdog'}, {'id': 378, ...
1        3  [{'id': 1361, 'name': 'salesclerk'}, {'id': 17...
2        5  [{'id': 612, 'name': 'hotel'}, {'id': 613, 'na...
3        6  [{'id': 520, 'name': 'chicago'}, {'id': 2231, ...
4       11  [{'id': 803, 'name': 'android'}, {'id': 4270, ...

In [20]:
### YOUR CODE HERE ###
df_res_10 = pd.merge(df_ratings, df_keywords, how='left', on='movieid' )
df_res_10.to_csv('result4_2.csv', index=False)

print('Result of pd.merge')
print(df_res_10.head())
print(len(df_res_10.index[:]), ' rows affected')

Result of pd.merge
   userid  movieid  rating   timestamp  \
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556

                                                tags
0  [{'id': 934, 'name': 'judge'}, {'id': 1533, 'n...
1  [{'id': 6930, 'name': 'fondling'}, {'id': 1018...
2  [{'id': 494, 'name': 'father son relationship'...
3                                                NaN
4  [{'id': 276, 'name': 'philadelphia'}, {'id': 3...
777776  rows affected

### Задача 11

Используя объединенную таблицу из предыдущего задания, найдите все идентификаторы фильмов с тегом `africa` (но не `south africa` или любые другие). Список тегов в формате JSON записан в столбце `tags`.

In [21]:
### YOUR CODE HERE ###

# в поле tags храняться данные которые не являются истинными JSON данными.
# строки экранированы одиночными кавычками, а не двойными 
# решение подсмотренно здесь https://ru.stackoverflow.com/questions/868622/%d0%9f%d0%b0%d1%80%d1%81%d0%b8%d0%bd%d0%b3-json-%d0%b2-%d0%ba%d0%be%d1%82%d0%be%d1%80%d0%be%d0%bc-%d0%b2%d1%81%d1%82%d1%80%d0%b5%d1%87%d0%b0%d1%8e%d1%82%d1%81%d1%8f-%d0%ba%d0%b0%d0%b2%d1%8b%d1%87%d0%ba%d0%b8-%d0%b2-%d0%ba%d0%b0%d0%b2%d1%8b%d1%87%d0%ba%d0%b0%d1%85/868688#868688
import ast 

df_res_10['tags_json'] = df_res_10['tags'].fillna('[]').apply(ast.literal_eval)

In [22]:
filter_str = 'africa'

df_res_11 = df_res_10[df_res_10['tags_json'].apply(lambda tags: filter_str in [item['name'] for item in tags])]
df_res_11.to_csv('africa.csv', index=False)
df_res_11.sample(10)

,userid,movieid,rating,timestamp,tags,tags_json
246305,2555,38198,3.0,1211718777,"[{'id': 291, 'name': 'circus'}, {'id': 409, 'n...","[{'id': 291, 'name': 'circus'}, {'id': 409, 'n..."
601650,6072,494,4.0,869079461,"[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam...","[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam..."
638114,6489,1672,4.0,891013720,"[{'id': 90, 'name': 'paris'}, {'id': 378, 'nam...","[{'id': 90, 'name': 'paris'}, {'id': 378, 'nam..."
704742,7176,494,3.0,975390651,"[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam...","[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam..."
172560,1802,7010,4.0,1158276038,"[{'id': 409, 'name': 'africa'}, {'id': 1930, '...","[{'id': 409, 'name': 'africa'}, {'id': 1930, '..."
690788,7040,488,3.0,1446508237,"[{'id': 409, 'name': 'africa'}, {'id': 440, 'n...","[{'id': 409, 'name': 'africa'}, {'id': 440, 'n..."
198506,2073,494,3.0,860007681,"[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam...","[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam..."
732833,7445,179,3.0,828364577,"[{'id': 242, 'name': 'new york'}, {'id': 407, ...","[{'id': 242, 'name': 'new york'}, {'id': 407, ..."
298501,3163,179,3.0,833089660,"[{'id': 242, 'name': 'new york'}, {'id': 407, ...","[{'id': 242, 'name': 'new york'}, {'id': 407, ..."
738956,7515,1672,5.0,976937676,"[{'id': 90, 'name': 'paris'}, {'id': 378, 'nam...","[{'id': 90, 'name': 'paris'}, {'id': 378, 'nam..."